#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ECSOrg/ECS-Workflow002/runs/run-CUYyh8hWsBwjMxWV

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
data.aws_acm_certificate.cert: Refreshing...
data.aws_route53_zone.main: Refreshing...
data.aws_route53_zone.main: Refresh complete after 0s [id=Z08799913V5YTD9L1K6NJ]
data.aws_acm_certificate.cert: Refresh complete after 0s [id=arn:aws:acm:us-east-1:545009829599:certificate/1b3c5517-c500-48a8-a8bb-34e0c75a31e7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.tls_public_key.MyLinuxBox will be read during apply
 <= data "tls_public_key" "MyLinuxBox" {
      + algorithm                     = (known after apply)
      + id                            = (known after apply)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
    }

  # aws_autoscaling_attachment.app1_asg_attachment will be created
  + resource "aws_autoscaling_attachment" "app1_asg_attachment" {
      + alb_target_group_arn   = (known after apply)
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_attachment.app2_asg_attachment will be created
  + resource "aws_autoscaling_attachment" "app2_asg_attachment" {
      + alb_target_group_arn   = (known after apply)
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.app1_asg will be created
  + resource "aws_autoscaling_group" "app1_asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 3
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupTotalInstances",
        ]
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 4
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "app1-auto-scaling-group-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_TERMINATING"
          + name                    = "scale-in-protection"
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 60
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "instance-protection-launch"
          + notification_metadata   = jsonencode(
                {
                  + key = "value"
                }
            )
            # (2 unchanged attributes hidden)
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "Production"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "app1-instance"
        }
    }

  # aws_autoscaling_group.app2_asg will be created
  + resource "aws_autoscaling_group" "app2_asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 3
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupTotalInstances",
        ]
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 4
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "app1-auto-scaling-group-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_TERMINATING"
          + name                    = "scale-in-protection"
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 60
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "instance-protection-launch"
          + notification_metadata   = jsonencode(
                {
                  + key = "value"
                }
            )
            # (2 unchanged attributes hidden)
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "Production"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "app2-443"
        }
    }

  # aws_autoscaling_policy.app1_scaling_policy will be created
  + resource "aws_autoscaling_policy" "app1_scaling_policy" {
      + arn                       = (known after apply)
      + autoscaling_group_name    = (known after apply)
      + estimated_instance_warmup = 120
      + id                        = (known after apply)
      + metric_aggregation_type   = (known after apply)
      + name                      = "app1-cpu-target"
      + policy_type               = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # aws_autoscaling_policy.app2_scaling_policy will be created
  + resource "aws_autoscaling_policy" "app2_scaling_policy" {
      + arn                       = (known after apply)
      + autoscaling_group_name    = (known after apply)
      + estimated_instance_warmup = 120
      + id                        = (known after apply)
      + metric_aggregation_type   = (known after apply)
      + name                      = "app2-cpu-target"
      + policy_type               = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "nat"
        }
      + tags_all             = {
          + "Name" = "nat"
        }
      + vpc                  = true
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"    = "app1_IG"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all = {
          + "Name"    = "app1_IG"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_template.app1_LT will be created
  + resource "aws_launch_template" "app1_LT" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-012967cc5a8c9f891"
      + instance_type          = "t2.micro"
      + key_name               = "MyLinuxBox"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "app1_LT"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKeXVtIHVwZGF0ZSAteQp5dW0gaW5zdGFsbCAteSBodHRwZApzeXN0ZW1jdGwgc3RhcnQgaHR0cGQKc3lzdGVtY3RsIGVuYWJsZSBodHRwZAoKIyBHZXQgdGhlIElNRFN2MiB0b2tlbgpUT0tFTj0kKGN1cmwgLVggUFVUICJodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9hcGkvdG9rZW4iIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW4tdHRsLXNlY29uZHM6IDIxNjAwIikKCiMgQmFja2dyb3VuZCB0aGUgY3VybCByZXF1ZXN0cwpjdXJsIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW46ICRUT0tFTiIgLXMgaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvbWV0YS1kYXRhL2xvY2FsLWlwdjQgJj4gL3RtcC9sb2NhbF9pcHY0ICYKY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9wbGFjZW1lbnQvYXZhaWxhYmlsaXR5LXpvbmUgJj4gL3RtcC9heiAmCmN1cmwgLUggIlgtYXdzLWVjMi1tZXRhZGF0YS10b2tlbjogJFRPS0VOIiAtcyBodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9tZXRhLWRhdGEvbmV0d29yay9pbnRlcmZhY2VzL21hY3MvICY+IC90bXAvbWFjaWQgJgp3YWl0CgptYWNpZD0kKGNhdCAvdG1wL21hY2lkKQpsb2NhbF9pcHY0PSQoY2F0IC90bXAvbG9jYWxfaXB2NCkKYXo9JChjYXQgL3RtcC9heikKdnBjPSQoY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9uZXR3b3JrL2ludGVyZmFjZXMvbWFjcy8kbWFjaWQvdnBjLWlkKQoKIyBDcmVhdGUgSFRNTCBmaWxlCmNhdCA8PC1IVE1MID4gL3Zhci93d3cvaHRtbC9pbmRleC5odG1sCjwhZG9jdHlwZSBodG1sPgo8aHRtbCBsYW5nPSJlbiIgY2xhc3M9ImgtMTAwIj4KPGhlYWQ+Cjx0aXRsZT5EZXRhaWxzIGZvciBFQzIgaW5zdGFuY2U8L3RpdGxlPgo8L2hlYWQ+Cjxib2R5Pgo8ZGl2Pgo8aDE+Q2xhc3MgNiB1bnNlY3VyZTwvaDE+CjxoMT5URkUgdy8gR2l0aHViIEFjdGlvbnM8L2gxPgo8cD48Yj5JbnN0YW5jZSBOYW1lOjwvYj4gJChob3N0bmFtZSAtZikgPC9wPgo8cD48Yj5JbnN0YW5jZSBQcml2YXRlIElwIEFkZHJlc3M6IDwvYj4gJGxvY2FsX2lwdjQ8L3A+CjxwPjxiPkF2YWlsYWJpbGl0eSBab25lOiA8L2I+ICRhejwvcD4KPHA+PGI+VmlydHVhbCBQcml2YXRlIENsb3VkIChWUEMpOjwvYj4gJHZwYzwvcD4KPC9kaXY+CjwvYm9keT4KPGlmcmFtZSBzcmM9Imh0dHBzOi8vZ2lwaHkuY29tL2VtYmVkL1B4bkIxZmpzOVNOcmkiIHdpZHRoPSI0ODAiIGhlaWdodD0iMjY5IiBzdHlsZT0iIiBmcmFtZUJvcmRlcj0iMCIgY2xhc3M9ImdpcGh5LWVtYmVkIiBhbGxvd0Z1bGxTY3JlZW4+PC9pZnJhbWU+PHA+PGEgaHJlZj0iaHR0cHM6Ly9naXBoeS5jb20vZ2lmcy92ZWdldGEtUHhuQjFmanM5U05yaSI+dmlhIEdJUEhZPC9hPjwvcD4KPC9odG1sPgpIVE1MCgojIENsZWFuIHVwIHRoZSB0ZW1wIGZpbGVzCnJtIC1mIC90bXAvbG9jYWxfaXB2NCAvdG1wL2F6IC90bXAvbWFjaWQK"
      + vpc_security_group_ids = (known after apply)

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"    = "app1_LT"
              + "Owner"   = "Chewbacca"
              + "Planet"  = "Mustafar"
              + "Service" = "application1"
            }
        }
    }

  # aws_launch_template.app2_LT_443 will be created
  + resource "aws_launch_template" "app2_LT_443" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-012967cc5a8c9f891"
      + instance_type          = "t2.micro"
      + key_name               = "MyLinuxBox"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "app2_LT_443"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKeXVtIHVwZGF0ZSAteQp5dW0gaW5zdGFsbCAteSBodHRwZApzeXN0ZW1jdGwgc3RhcnQgaHR0cGQKc3lzdGVtY3RsIGVuYWJsZSBodHRwZAoKIyBHZXQgdGhlIElNRFN2MiB0b2tlbgpUT0tFTj0kKGN1cmwgLVggUFVUICJodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9hcGkvdG9rZW4iIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW4tdHRsLXNlY29uZHM6IDIxNjAwIikKCiMgQmFja2dyb3VuZCB0aGUgY3VybCByZXF1ZXN0cwpjdXJsIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW46ICRUT0tFTiIgLXMgaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvbWV0YS1kYXRhL2xvY2FsLWlwdjQgJj4gL3RtcC9sb2NhbF9pcHY0ICYKY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9wbGFjZW1lbnQvYXZhaWxhYmlsaXR5LXpvbmUgJj4gL3RtcC9heiAmCmN1cmwgLUggIlgtYXdzLWVjMi1tZXRhZGF0YS10b2tlbjogJFRPS0VOIiAtcyBodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9tZXRhLWRhdGEvbmV0d29yay9pbnRlcmZhY2VzL21hY3MvICY+IC90bXAvbWFjaWQgJgp3YWl0CgptYWNpZD0kKGNhdCAvdG1wL21hY2lkKQpsb2NhbF9pcHY0PSQoY2F0IC90bXAvbG9jYWxfaXB2NCkKYXo9JChjYXQgL3RtcC9heikKdnBjPSQoY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9uZXR3b3JrL2ludGVyZmFjZXMvbWFjcy8kbWFjaWQvdnBjLWlkKQoKIyBDcmVhdGUgSFRNTCBmaWxlCmNhdCA8PC1IVE1MID4gL3Zhci93d3cvaHRtbC9pbmRleC5odG1sCjwhZG9jdHlwZSBodG1sPgo8aHRtbCBsYW5nPSJlbiIgY2xhc3M9ImgtMTAwIj4KPGhlYWQ+Cjx0aXRsZT5EZXRhaWxzIGZvciBFQzIgaW5zdGFuY2U8L3RpdGxlPgo8L2hlYWQ+Cjxib2R5Pgo8ZGl2Pgo8aDE+Q2xhc3MgNiBTZWN1cmU8L2gxPgo8aDE+VEZFIHcvIEdpdGh1YiBBY3Rpb25zPC9oMT4KPHA+PGI+SW5zdGFuY2UgTmFtZTo8L2I+ICQoaG9zdG5hbWUgLWYpIDwvcD4KPHA+PGI+SW5zdGFuY2UgUHJpdmF0ZSBJcCBBZGRyZXNzOiA8L2I+ICRsb2NhbF9pcHY0PC9wPgo8cD48Yj5BdmFpbGFiaWxpdHkgWm9uZTogPC9iPiAkYXo8L3A+CjxwPjxiPlZpcnR1YWwgUHJpdmF0ZSBDbG91ZCAoVlBDKTo8L2I+ICR2cGM8L3A+CjwvZGl2Pgo8L2JvZHk+CjxpZnJhbWUgc3JjPSJodHRwczovL2dpcGh5LmNvbS9lbWJlZC9QeG5CMWZqczlTTnJpIiB3aWR0aD0iNDgwIiBoZWlnaHQ9IjI2OSIgc3R5bGU9IiIgZnJhbWVCb3JkZXI9IjAiIGNsYXNzPSJnaXBoeS1lbWJlZCIgYWxsb3dGdWxsU2NyZWVuPjwvaWZyYW1lPjxwPjxhIGhyZWY9Imh0dHBzOi8vZ2lwaHkuY29tL2dpZnMvdmVnZXRhLVB4bkIxZmpzOVNOcmkiPnZpYSBHSVBIWTwvYT48L3A+CjwvaHRtbD4KSFRNTAoKIyBDbGVhbiB1cCB0aGUgdGVtcCBmaWxlcwpybSAtZiAvdG1wL2xvY2FsX2lwdjQgL3RtcC9heiAvdG1wL21hY2lkCg=="
      + vpc_security_group_ids = (known after apply)

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"    = "app2_LT_443"
              + "Owner"   = "Chewbacca"
              + "Planet"  = "Mustafar"
              + "Service" = "application1"
            }
        }
    }

  # aws_lb.app1_alb will be created
  + resource "aws_lb" "app1_alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "app1-load-balancer"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Name"    = "App1LoadBalancer"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "App1"
        }
      + tags_all                   = {
          + "Name"    = "App1LoadBalancer"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "App1"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-1:545009829599:certificate/1b3c5517-c500-48a8-a8bb-34e0c75a31e7"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.app1_tg will be created
  + resource "aws_lb_target_group" "app1_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "app1-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "App1TargetGroup"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "App1"
        }
      + tags_all                           = {
          + "Name"    = "App1TargetGroup"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "App1"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)
    }

  # aws_lb_target_group.app2_tg_443 will be created
  + resource "aws_lb_target_group" "app2_tg_443" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "app2-tg-443"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "App1TargetGroup"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "app2_tg_443 "
        }
      + tags_all                           = {
          + "Name"    = "App1TargetGroup"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "app2_tg_443 "
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)
    }

  # aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat"
        }
      + tags_all             = {
          + "Name" = "nat"
        }
    }

  # aws_route53_record.www will be created
  + resource "aws_route53_record" "www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "eastcoastsaiyans001.com"
      + type            = "A"
      + zone_id         = "Z08799913V5YTD9L1K6NJ"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "private"
        }
      + tags_all         = {
          + "Name" = "private"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "public"
        }
      + tags_all         = {
          + "Name" = "public"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private-us-east-1a will be created
  + resource "aws_route_table_association" "private-us-east-1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private-us-east-1b will be created
  + resource "aws_route_table_association" "private-us-east-1b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private-us-east-1c will be created
  + resource "aws_route_table_association" "private-us-east-1c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-east-1a will be created
  + resource "aws_route_table_association" "public-us-east-1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-east-1b will be created
  + resource "aws_route_table_association" "public-us-east-1b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-east-1c will be created
  + resource "aws_route_table_association" "public-us-east-1c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.app1-sg01-servers will be created
  + resource "aws_security_group" "app1-sg01-servers" {
      + arn                    = (known after apply)
      + description            = "app1-sg01-servers"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "MyHomePage"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "app1-sg01-servers"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "app1-sg01-servers"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "app1-sg01-servers"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.app1-sg02-LB01 will be created
  + resource "aws_security_group" "app1-sg02-LB01" {
      + arn                    = (known after apply)
      + description            = "app1-sg02-LB01"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "MyHomePage"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Secure"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "app1-sg02-LB01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "app1-sg02-LB01"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "app1-sg02-LB01"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.app1-sg03-secure-servers will be created
  + resource "aws_security_group" "app1-sg03-secure-servers" {
      + arn                    = (known after apply)
      + description            = "app1-sg03-secure-servers"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "MyHomePage"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "app1-sg03-secure-servers"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "app1-sg03-secure-servers"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "app1-sg03-secure-servers"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private-us-east-1a will be created
  + resource "aws_subnet" "private-us-east-1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-east-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-east-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-us-east-1b will be created
  + resource "aws_subnet" "private-us-east-1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-east-1b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-east-1b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-us-east-1c will be created
  + resource "aws_subnet" "private-us-east-1c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-east-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-east-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-east-1a will be created
  + resource "aws_subnet" "public-us-east-1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-east-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-east-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-east-1b will be created
  + resource "aws_subnet" "public-us-east-1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-east-1b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-east-1b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-east-1c will be created
  + resource "aws_subnet" "public-us-east-1c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-east-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-east-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.app1 will be created
  + resource "aws_vpc" "app1" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.32.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "app1"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application1"
        }
      + tags_all                             = {
          + "Name"    = "app1"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application1"
        }
    }

  # tls_private_key.MyLinuxBox will be created
  + resource "tls_private_key" "MyLinuxBox" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 36 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + http_address  = (known after apply)
  + https_address = (known after apply)
  + lb_dns_name   = (known after apply)
  + private_key   = (sensitive value)
  + public_key    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @LD2343, Action: `pull_request`*